package seminar.task1;
/*Создать обобщенный класс с тремя параметрами (T, V,K).
Класс содержит три переменные типа (T,V,K)
конструктор, принимающий на вход параметры типа (T,V,K)
методы возвращающие значения трех переменных.

Создать метод, выводящий на консоль имена классов для трех переменных класса.
Наложить ограничения на параметры типа:
T должнен реализоввать интерфейс Comparable;
V должен реализовать интерфейс DataInput и расширять класс InputStream
K должен расширить класс Number
 */

public class Main {
}
